ЕРПУХАстенд.cbr_Основной/src/DataProcessors/ПодборТоваровВДокументПродажи/ПодборТоваровВДокументПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5bd06a3a-d777-4c8b-bda4-33306460faca">
  <name>ПодборТоваровВДокументПродажи</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

ЕРПУХАстенд.cbr_Основной/src/Enums/ВариантыОбеспечения/ВариантыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="48a11946-4d50-41a7-919b-49bf18403be5">
  <name>ВариантыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="9b0356bb-5966-4577-ab5a-bbc09ae9323b">
    <name>Отгрузить</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="cd44cebd-862f-40b1-a297-247d05c45d2f">
    <name>СоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="970e966f-77d3-4ec1-9ca5-f2f5a2a8e2d1">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="865e7fe8-0ba5-430f-8819-98ee2644d5c5">
    <name>НеТребуется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ЕРПУХАстенд.cbr_Основной/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="951a5403-e1a4-4484-8fda-c18df8f291d3">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="57507687-e857-4627-84a6-131b6dc5555a">
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d257be95-baab-4cf8-b5ae-541216c91b07">
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="898c017b-174f-4670-8146-5c6e75af51c1">
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ЕРПУХАстенд.cbr_Основной/src/DataProcessors/ПодборТоваровВДокументПродажи/Forms/Форма/Module.bsl
#Область СлужебныеПроцедурыИФункции

//++ cba AlopinAS 27.01.26
&ИзменениеИКонтроль("ДобавитьВКорзинуНаКлиенте")
&НаСервере
Функция cbr_ДобавитьВКорзинуНаКлиенте(ПараметрыТовара, НовыеСтроки)

	ПустаяКорзина = Объект.Корзина.Количество() = 0;
	РеквизитыОтбора = "Артикул, НоменклатураНабора, ХарактеристикаНабора, Номенклатура, Характеристика,
		|ХарактеристикиИспользуются, Упаковка, Цена, ВидЦены, Склад, ПроцентРучнойСкидки, ТипНоменклатуры,
		|СрокПоставки, ВариантОбеспечения, Обособленно, Серия";
	Если ИспользоватьДатыОтгрузки Тогда
		РеквизитыОтбора = РеквизитыОтбора + ", ДатаОтгрузки";
	КонецЕсли;
	Отбор = Новый Структура(РеквизитыОтбора);

	ИдентификаторыДляУстановкиСтатусаСерий = Новый Массив;
	ОбрабатываемыеСтроки = Новый Массив;
	ОбрабатываемыеСтрокиСПогрешностью = Новый Массив;
	ПогрешностьСтрок = Новый Соответствие();
	ОбрабатываемыеСтрокиСЦеной = Новый Массив;

	Для Каждого НоваяСтрока Из НовыеСтроки Цикл

		ЗаполнитьЗначенияСвойств(Отбор, НоваяСтрока);
		#Вставка
		
		//++ cba AlopinAS 27.01.26
		Отбор.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.НеТребуется");
		//-- cba AlopinAS 27.01.26
		
		#КонецВставки
		Если НоваяСтрока.Цена = 0 Тогда
			Отбор.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Отбор.ТипНоменклатуры) Тогда
			Отбор.ТипНоменклатуры = ПараметрыТовара.ТипНоменклатуры;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Отбор.ВариантОбеспечения)
				И НЕ Отбор.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Набор") Тогда
			ЗаполнитьВариантОбеспеченияИФлагНаСервере(Отбор);
		КонецЕсли;

		Если ПустаяКорзина Тогда
			РезультатПоиска = Новый Массив;
		Иначе
			РезультатПоиска = Объект.Корзина.НайтиСтроки(Отбор);
		КонецЕсли;

		ЦелевойМассив = ОбрабатываемыеСтроки;

		Если РезультатПоиска.Количество() = 0 Или НоваяСтрока.Погрешность <> 0 Тогда

			ТекущаяСтрока = Объект.Корзина.Добавить();
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Отбор);
			ТекущаяСтрока.ИндексНабора = ?(ЗначениеЗаполнено(ТекущаяСтрока.НоменклатураНабора), 1, 0);

			ЦелевойМассив = ОбрабатываемыеСтрокиСПогрешностью;
			ПогрешностьСтрок.Вставить(ТекущаяСтрока, НоваяСтрока.Погрешность);

			Если Не ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Набор")
				И (РежимПодбораБезСуммовыхПараметров
				Или Не ЗапрашиватьЦену
				Или ЦенообразованиеВызовСервера.НеобходимПересчетЦеныПриИзменении(ТекущаяСтрока.Номенклатура, "Серия", Неопределено)) Тогда

				ЦелевойМассив = ОбрабатываемыеСтрокиСЦеной;

			КонецЕсли;

		Иначе
			ТекущаяСтрока = РезультатПоиска[0];
		КонецЕсли;

		ТекущаяСтрока.КоличествоУпаковок = ТекущаяСтрока.КоличествоУпаковок + НоваяСтрока.КоличествоУпаковок;

		ЦелевойМассив.Добавить(ТекущаяСтрока);

		Если Не ПоказыватьПодобранныеТовары Тогда

			ТекстОповещения = Символы.ПС + НСтр("ru = 'Товар ""[Товар]"" стоимостью [Цена] [Валюта] в количестве [КоличествоУпаковок] [ЕдиницаИзмерения] добавлен в корзину';
												|en = 'The ""[Товар]"" goods of value [Цена] [Валюта] are added to the cart in quantity of [КоличествоУпаковок] [ЕдиницаИзмерения]'");

			ВставляемыеЗначения = Новый Структура("Товар, Цена, Валюта, КоличествоУпаковок, ЕдиницаИзмерения");

			ВставляемыеЗначения.Товар              = Строка(ТекущаяСтрока.Номенклатура) + ?(ЗначениеЗаполнено(НоваяСтрока.Характеристика)," (" + НоваяСтрока.Характеристика + ")","");
			ВставляемыеЗначения.Цена               = Формат(ТекущаяСтрока.Цена, "ЧДЦ=2; ЧН=");
			ВставляемыеЗначения.Валюта             = Валюта;
			ВставляемыеЗначения.ЕдиницаИзмерения   = ?(ЗначениеЗаполнено(НоваяСтрока.Упаковка), НоваяСтрока.Упаковка, НСтр("ru = 'ед.';
																															|en = 'unit'"));
			ВставляемыеЗначения.КоличествоУпаковок = НоваяСтрока.КоличествоУпаковок;

			ТекстОповещения = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТекстОповещения, ВставляемыеЗначения);

		КонецЕсли;

		ТекущаяСтрока.ЗаказатьНаСклад = Истина;
		Если ЗначениеЗаполнено(ПараметрыУказанияСерий) Тогда
			Если Не ПроверитьУстановитьСтатусСерий(ТекущаяСтрока, ПараметрыУказанияСерий) Тогда
				ИдентификаторыДляУстановкиСтатусаСерий.Добавить(ТекущаяСтрока.ПолучитьИдентификатор());
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	ДополнитьСтруктуруДействиямиПересчетаСумм(СтруктураДействий);

	СтруктураДействийСПогрешностью = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураДействий, Ложь);
	СтруктураДействийСПогрешностью.Вставить("ПересчитатьСуммуСУчетомПогрешностиОкругления",
		Новый Структура("ПогрешностиПоСтрокам", ПогрешностьСтрок));

	СтруктураДействийСПогрешностью.Вставить("ЗаполнитьПризнакНаличияНоменклатурыПродаваемойСовместно",
		ВариантАнализаНоменклатурыПродаваемойСовместно);

	СтруктураДействийСЦеной = Новый Структура();
	Если ОбрабатываемыеСтрокиСЦеной.Количество() Тогда
		СтруктураДействийСЦеной = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураДействийСПогрешностью, Ложь);
		ДополнитьСтруктуруДействиямиРасчетаЦены(ЭтотОбъект, СтруктураДействийСЦеной, ОбрабатываемыеСтрокиСЦеной[0]);
	КонецЕсли;

	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ОбрабатываемыеСтроки,
		СтруктураДействий,
		Объект.Корзина,
		Неопределено);

	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ОбрабатываемыеСтрокиСПогрешностью,
		СтруктураДействийСПогрешностью,
		Объект.Корзина,
		Неопределено);

	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ОбрабатываемыеСтрокиСЦеной,
		СтруктураДействийСЦеной,
		Объект.Корзина,
		Неопределено);

	Если ИдентификаторыДляУстановкиСтатусаСерий.Количество() > 0 Тогда
		ЗаполнитьСтатусыУказанияСерийПоИдентификатору(ИдентификаторыДляУстановкиСтатусаСерий);
	КонецЕсли;

	Если НовыеСтроки.Количество() > 0 Тогда
		Элементы.Корзина.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
	КонецЕсли;

	Возврат ТекстОповещения;

КонецФункции
//-- cba AlopinAS 27.01.26

#КонецОбласти
